#include <iostream>
#include <stack>
#include <string>

/*
ВНИМАНИЕ! Для решения данной задачи нужно использовать структуру данных стек!

Пара слов называется стековой анаграмой, если одно слово можно получить из
другого, проведя последовательность стековых операций с его буквами (взять
очередную букву исходного слова и поместить ее в стек; взять букву из стека и
добавить ее в конец выходного слова). Для заданной пары слов требуется
определить, можно ли выполнить последовательность стековых операций, переводящую
первое слово во второе. Все буквы в слове различные. Длина анаграммы ≤ 10000.

Формат ввода

Пара слов, являющихся анаграммой.

Формат вывода

YES, если последовательность операций существует, и NO в противном случае.
*/

int main() {
  std::string s1 { "" }, s2 { "" };
  std::cin >> s1 >> s2;

  std::stack<char> s;

  // кравевой случай
  if (s1.length() != s2.length())
    std::cout << "NO" << std::endl;

  auto i = 0;
  for (auto j = 0; j < s2.length(); j++) {
    while(s.empty() || s.top() != s2[j]) {
      if (i == s1.length()) {
        std::cout << "NO" << std::endl;
        return 0;
      }
      s.push(s1[i++]);
    }
    s.pop();
  }

  std::cout << "YES" << std::endl;
  
  return 0;
}
