#include <iostream>

/*
Инвертирование бита

Инвертируйте значение бита в числе N по его номеру K. Необходимо использование
битовых операций. Использование арифметических операций запрещено.

Формат ввода

Сначала вводится число N.
Оно лежит в диапазоне 0..2^{32}-1 и вводится в десятичном виде.

Далее вводится номер бита K.
Лежит в диапазоне 0..31 и вводится в десятичном виде.

Формат вывода

Выходное число выводится в десятичном виде. 
*/

unsigned int invert_bit(unsigned int N, unsigned int k) {
  return N ^ (1 << k);
}

int main() {
  unsigned int N, k;
  std::cin >> N >> k;
  
  std::cout << invert_bit(N, k) << std::endl;
  
  return 0;
}
